//=================================================================================================
//- File: stm32g031xx_interrupt.c
//- Creation Date: 22_0211A / Modify : 22_0207A
//- Encoding: UTF-8
//=================================================================================================
//- Code Style
//- 01. a : a_Data[] (Array Variable)
//- 02. v : v_Data (Variable)
//- 03. e : e_Data (Enum)
//- 04. m : m_Data (Enum Member)
//- 05. d : d_Data (Define)
//- 06. u : u_Data (Union)
//- 07. p : p_Data (Pointer)
//- 08. t : t_Data (TypeDef)
//- 09. s : s_Data (Structuer)
//- 10. g : gv_Data (Global Variable)
//=================================================================================================

#include "stm32f030f4p6_interrupt.h"

//=====================================================================================================================
//= Name  : _fNVIC_INIT
//= Cycle : One
//= Date  : 19.1202A
//=====================================================================================================================
void _fNVIC_INIT(void)
{
    //- NVIC->IP[6] {27번 26번 25번 24번]
    //- NVIC->IP[5] {23번 22번 21번 20번]
    //- NVIC->IP[4] {19번 18번 17번 16번]
    //- NVIC->IP[3] {15번 14번 13번 12번]
    //- NVIC->IP[2] {11번 10번 09번 08번]
    //- NVIC->IP[1] {07번 06번 05번 04번]
    //- NVIC->IP[0] {03번 02번 01번 00번]
    //- UART1 SET
    //- Vector Table Uart1 Position 27, Priority 34
    NVIC->IP[6] &= 0x00FF00FFu; //- 27 Pos Data Cler
    NVIC->ISER[0U] = 0x0A000000u;    //- 27BIT 비트 설정 인터럽트 활성

}